{
    "language": {
        "language": "es",
        "english": "Ingles",
        "spanish": "Espanol"
    },
    "folder": {
        "workHistory": "Historial Laboral",
        "personalProjects": "Proyectos personales",
        "linkedinReviews": "Recomendaciones de Linkedin"
    },
    "navBar": {
        "file": "Archivo",
        "view": "Pantalla",
        "socials": "Sociales",
        "language": "Idioma"
    },
    "textFiles": {
        "langauges/frameworks": "lenguajes/marcos de trabajo",
        "reviewedBy": "Revisado por",
        "techStack": "Pila tecnol贸gica",
        "changeLog": "Registro de cambios"
    },
    "work": {
        "activision": {
            "positionTitle": "Ingeniero de Software",
            "startDate": "Enero 2020",
            "endDate": "Enero 2024",
            "bulletPoints": [
                "Cre茅 las tablas de clasificaci贸n de los 250 mejores jugadores de multijugador y Warzone para Call of Duty (CoD): Modern Warfare 3, lo que permiti贸 a los usuarios ver a los mejores jugadores del mundo y destac贸 a los jugadores profesionales de la escena de los eSports de Call of Duty.",
                "Cre茅 la tabla de clasificaci贸n de Zombis para CoD: Modern Warfare 3, que permiti贸 a los usuarios comparar su progreso con el de sus amigos y otros miembros de la comunidad de CoD.",
                "Colabor茅 con el equipo para integrar pantallas de estad铆sticas y tablas de clasificaci贸n en la serie Call of Duty, permitiendo a los usuarios compararse con amigos, streamers favoritos y los mejores jugadores de la comunidad, lo que aument贸 la interacci贸n de los usuarios al comparar estad铆sticas.",
                "Resolv铆 problemas de estilo y funcionalidad en el Acuerdo de Licencia de Usuario Final para CoD: Modern Warfare 2 y Modern Warfare 3, creando un acuerdo legal m谩s f谩cil de leer y ayudando a la empresa a evitar posibles problemas legales costosos.",
                "Colabor茅 con el equipo de marketing para promocionar las nuevas funciones introducidas en cada temporada, creando mensajes del d铆a que destacaban las nuevas funciones (incluido el Pase de Batalla Black Cell y los modos de juego de tiempo limitado) lanzadas con cada nueva temporada de Modern Warfare 2 y Modern Warfare 3.",
                "Dise帽茅, desarroll茅 y mantuve un marco de pruebas de control de calidad interno con m谩s de 300 casos de prueba para la aplicaci贸n complementaria de CoD, el Mensaje del D铆a, myCoD (versi贸n web de la aplicaci贸n complementaria) y varios sitios web promocionales de juegos (Tony Hawk Pro Skater, Crash Bandicoot, Spyro, etc.).",
                "Utilic茅 Appium y Python para la aplicaci贸n complementaria de CoD y realic茅 pruebas en dispositivos iOS y Android con emuladores y dispositivos f铆sicos.",
                "Utilic茅 Playwright y TypeScript para los casos de prueba de los sitios web promocionales de juegos, myCoD y el Mensaje del D铆a.",
                "Compart铆 conocimientos con el equipo de desarrollo para que comprendieran Appium/Selenium y c贸mo ejecutar los scripts de prueba en sus propias ramas.",
                "Actualic茅 y mantuve la documentaci贸n interna de la aplicaci贸n complementaria de Call of Duty, lo que ayud贸 a evitar que el equipo tuviera lagunas de conocimiento sobre la base de c贸digo.",
                "Trabaj茅 con el equipo de desarrollo para garantizar que los datos de la API se mostraran correctamente utilizando Postman.",
                "Reduje el n煤mero de compilaciones rechazadas por el equipo de control de calidad externo en m谩s del 90%, garantizando que las actualizaciones se entregaran a tiempo.",
                "Resolv铆 numerosos errores de prioridad baja a media en la aplicaci贸n complementaria de CoD, lo que permiti贸 al equipo de desarrollo centrarse en funciones m谩s importantes y errores cr铆ticos de la aplicaci贸n.",
                "Agregu茅 etiquetas de accesibilidad a los componentes existentes en la aplicaci贸n complementaria de CoD.",
                "Aplicaci贸n para crear localizadores estables para los scripts de prueba, lo que ayud贸 a los usuarios con problemas de accesibilidad.",
                "Se ampli贸 y mantuvo el script de automatizaci贸n para redimensionar im谩genes y adaptarlas a dispositivos m贸viles y de escritorio, reduciendo el tiempo que los desarrolladores ten铆an que dedicar a este proceso, permiti茅ndoles concentrarse en problemas y funciones m谩s importantes.",
                "Se implement贸 un marco de pruebas y scripts de redimensionamiento de im谩genes en un Mac mini remoto para ejecutar pruebas nocturnas en la 煤ltima rama de desarrollo y se enviaron los resultados a un canal de Slack dedicado.",
                "Se aument贸 la eficiencia del equipo de desarrollo al reducir el tiempo de respuesta para los errores detectados, garantizando el cumplimiento de los plazos de lanzamiento de cada nueva actualizaci贸n de la aplicaci贸n.",
                "Se gestionaron todos los correos electr贸nicos y mensajes directos de consultas de los usuarios sobre la aplicaci贸n y se respondieron de manera oportuna."
            ]
        },
        "sqaSquared": {
            "positionTitle": "Ingeniero de software junior en prueba",
            "startDate": "Mayo 2019",
            "endDate": "Enero 2020",
            "bulletPoints": [
                "Mantuve la automatizaci贸n de pruebas web para Ticketmaster, asegurando que el sitio web permaneciera libre de errores y manteniendo un proceso de compra de entradas sin problemas para los clientes.",
                "Mantuve la automatizaci贸n de pruebas de aplicaciones para OSHI Health, ayudando al equipo de desarrollo a crear la mejor aplicaci贸n posible durante la fase de desarrollo y evitando que se encontraran errores en la versi贸n de producci贸n.",
                "Resolv铆 un problema relacionado con las ventanas emergentes de permisos de Android que bloqueaban las pruebas de la aplicaci贸n OSHI Health, eliminando un problema importante que imped铆a que la automatizaci贸n registrara los errores con precisi贸n y retrasaba las correcciones por parte del equipo de desarrollo."
            ]
        },
        "movingMindz": {
            "positionTitle": "Desarrollador web / Tutor",
            "startDate": "Junio 2018",
            "endDate": "Marzo 2020",
            "bulletPoints": [
                "Desarroll茅 la interfaz de usuario y el sistema de gesti贸n del sitio web de la empresa. Esto facilit贸 que las escuelas interesadas, los padres potenciales y los padres de alumnos actuales pudieran obtener m谩s informaci贸n sobre los programas extraescolares disponibles y las sesiones de tutor铆a individual.",
                "Dirig铆 clubes extraescolares para ni帽os, ense帽ando Python y contribuyendo a construir relaciones positivas con las escuelas asociadas y los padres de los ni帽os matriculados en las clases."
            ]
        }
    },
    "personalProjects": {
        "zombies": {
            "description": [
                "Un juego de supervivencia contra zombis sin fin creado en Godot 4."
            ],
            "imageAlt": "GIF del juego de supervivencia contra zombis"
        },
        "wellnessApp": {
            "description": [
                "Una aplicaci贸n de bienestar creada con React Native.",
                "El objetivo de este proyecto es crear una aplicaci贸n que ayude a los usuarios a hacer un seguimiento de los s铆ntomas de sus enfermedades cr贸nicas.",
                "Ayudando a los usuarios a registrar y visualizar los s铆ntomas que han experimentado durante el 煤ltimo d铆a, semana, mes, a帽o, etc."
            ],
            "imageAlt": "Pantalla de inicio de la aplicaci贸n de salud"
        }
    },
    "zombiesChangeLog": {
        "version": "Versi贸n",
        "version0.1": {
            "changeLog": [
                "Las estad铆sticas de las armas, el jugador y los zombis estaban programadas directamente en el c贸digo. ",
                "Se a帽adieron mec谩nicas de movimiento y disparo al juego para mando, teclado y rat贸n.",
                "Se a帽adieron efectos de sonido provisionales para disparar y recargar.",
                "Se a帽adi贸 una animaci贸n de recarga al estilo Doom.",
                "Se a帽adi贸 un sistema de detecci贸n de impactos mediante raycasting para saber cu谩ndo se golpea a un enemigo."
            ]
        },
        "version0.2": {
            "changeLog": [
                "Iluminaci贸n global a帽adida",
                "Puntos de aparici贸n de enemigos",
                "L贸gica para que los zombis aparezcan continuamente y persigan al jugador",
                "Nuevo modelo de arma con un l谩ser de punter铆a que ayuda a los jugadores a apuntar",
                "El l谩ser se apaga cuando el arma no est谩 en pantalla"
            ]
        },
        "version0.3": {
            "changeLog": [
                "Se ha reescrito la l贸gica tanto para los enemigos como para las armas para que utilicen el sistema de recursos de Godot (similar a los planos en Unreal Engine)."
            ]
        }
    },
    "linkedinRecommendations": {
        "timJung": {
            "bodyText": [
                "Trabaj茅 con Brandon en proyectos de ingenier铆a en Activision y es un excelente ingeniero.",
                "Pero nuestra historia se remonta a mucho antes.",
                "Conoc铆 a Brandon porque era un asistente habitual y entusiasta de la Community Hack Night de Los ngeles, una reuni贸n mensual de ingenieros y entusiastas de la tecnolog铆a que yo organizaba en el campus de Riot Games (mientras a煤n trabajaba en Activision).",
                "Brandon ten铆a un inter茅s genuino en Call of Duty y la ingenier铆a.",
                "Y se propuso demostrarlo.",
                "Una noche, en la Community Hack Night, se me acerc贸 y me mostr贸 un proyecto que hab铆a creado 茅l mismo: automatizaba una gran cantidad de pruebas en la aplicaci贸n complementaria de Call of Duty (el producto en el que trabajaba en Activision).",
                "Francamente, ni siquiera sab铆a que era posible hacer algo as铆 sin el c贸digo fuente.",
                "Me qued茅 asombrado. Brandon se hab铆a esforzado en su tiempo libre para crear algo realmente 煤til para un proyecto en el que yo trabajaba, simplemente porque le importaba.",
                "Al d铆a siguiente se lo mostr茅 a mi director y 茅l tambi茅n qued贸 impresionado.",
                "Decidi贸 entrevistar a Brandon y finalmente lo contrat贸 para que se uniera a nuestro equipo que trabajaba en la aplicaci贸n de Call of Duty.",
                "Brandon desarroll贸 un conjunto de excelentes pruebas para el proyecto que nos ayudaron a mejorar la baja calificaci贸n de la aplicaci贸n en la tienda y a subirla a 4.8 estrellas.",
                "Luego se convirti贸 en un ingeniero de pleno derecho, desarrollando funciones para los jugadores.",
                "Gracias a su capacidad para combinar sus pasiones con su ambici贸n de mejorar continuamente sus habilidades, Brandon ha demostrado una s贸lida trayectoria en la creaci贸n de productos de ingenier铆a de alta calidad.",
                "Es un ejemplo excepcional de alguien que encuentra la manera de abrirse camino incluso cuando no hay un camino evidente.",
                "Sin duda, querr谩s a Brandon en cualquier equipo en el que est茅 interesado en participar."
            ]
        },
        "shadaeKawaguchi": {
            "bodyText": [
                "He tenido el placer de trabajar con Brandon durante los 煤ltimos a帽os y hemos colaborado en varios proyectos, algunos de los cuales se pueden ver en el juego.",
                "Trabajar con Brandon en estos proyectos ha sido un proceso muy fluido.",
                "Como desarrollador, tomaba los dise帽os que le proporcion谩bamos y los implementaba en c贸digo para darles vida.",
                "Tiene un amplio conocimiento y experiencia, y siempre est谩 dispuesto a ayudar y a responder cualquier pregunta que le haga.",
                "Su sentido del humor y su actitud positiva hicieron que fuera muy f谩cil trabajar con 茅l, y ser铆a una valiosa incorporaci贸n para cualquier equipo."
            ]
        }
    }
}
